//==================================================================
//												TestWorld.h
//	テストワールド
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2021/05/14	テストワールドクラス作成
//
//===================================================================

#pragma once

//====== インクルード部 ======
#include "../ECS/World/World.h"


//===== マクロ定義 =====


//===== クラス定義 =====
namespace ECS
{
	// マスターワールドクラス
	class TestWorld : public World
	{
	public:
		// コンストラクタ
		TestWorld(std::string name);
		// デストラクタ
		virtual ~TestWorld();

		// ワールドの初期化
		virtual void Start();
		// ワールドの終了
		virtual void End();
	};
}
